{
    "monster": {
        "name": "Qwilfish",
        "attack": 95,
        "defense": 75,
        "speed": 85,
        "sp_atk": 55,
        "sp_def": 55,
        "hp": 65,
        "weight": "39",
        "height": "5",
        "national_id": 211,
        "male_female_ratio": "",
        "catch_rate": 0,
        "_id": "00211",
        "abilities": [
            "intimidate",
            "swift-swim",
            "poison-point"
        ],
        "types": [
            "poison",
            "water"
        ]
    },
    "description": [
        {
            "description": "It shoots the poison spines on its body in all directions. Its round form makes it a poor swimmer.",
            "_id": "0003318",
            "_rev": "1-A"
        }
    ],
    "evolution": {
        "from": null,
        "to": null,
        "_id": "00211",
        "_rev": "1-A"
    },
    "types": [
        {
            "whenDefending": [
                {
                    "multiplier": 0.5,
                    "name": "fighting"
                },
                {
                    "multiplier": 0.5,
                    "name": "poison"
                },
                {
                    "multiplier": 2,
                    "name": "ground"
                },
                {
                    "multiplier": 0.5,
                    "name": "bug"
                },
                {
                    "multiplier": 0.5,
                    "name": "grass"
                },
                {
                    "multiplier": 2,
                    "name": "psychic"
                },
                {
                    "multiplier": 0.5,
                    "name": "fairy"
                }
            ],
            "whenAttacking": [
                {
                    "multiplier": 0.5,
                    "name": "poison"
                },
                {
                    "multiplier": 0.5,
                    "name": "ground"
                },
                {
                    "multiplier": 0.5,
                    "name": "rock"
                },
                {
                    "multiplier": 0.5,
                    "name": "ghost"
                },
                {
                    "multiplier": 0,
                    "name": "steel"
                },
                {
                    "multiplier": 2,
                    "name": "grass"
                },
                {
                    "multiplier": 2,
                    "name": "fairy"
                }
            ],
            "_id": "poison",
            "_rev": "1-A"
        },
        {
            "whenDefending": [
                {
                    "multiplier": 0.5,
                    "name": "steel"
                },
                {
                    "multiplier": 0.5,
                    "name": "fire"
                },
                {
                    "multiplier": 0.5,
                    "name": "water"
                },
                {
                    "multiplier": 2,
                    "name": "grass"
                },
                {
                    "multiplier": 2,
                    "name": "electric"
                },
                {
                    "multiplier": 0.5,
                    "name": "ice"
                }
            ],
            "whenAttacking": [
                {
                    "multiplier": 0.5,
                    "name": "water"
                },
                {
                    "multiplier": 0.5,
                    "name": "grass"
                },
                {
                    "multiplier": 0.5,
                    "name": "dragon"
                },
                {
                    "multiplier": 2,
                    "name": "fire"
                },
                {
                    "multiplier": 2,
                    "name": "ground"
                },
                {
                    "multiplier": 2,
                    "name": "rock"
                }
            ],
            "_id": "water",
            "_rev": "1-A"
        }
    ],
    "monster_supplemental": {
        "specialAttackEV": 0,
        "hpEV": 0,
        "hatchSteps": 5100,
        "defenseEV": 0,
        "attackEV": 1,
        "specialDefenseEV": 0,
        "speedEV": 0,
        "genderRatio": 50,
        "species": "Balloon Pokémon",
        "japaneseName": "ハリーセン",
        "Guranburu": "",
        "eggGroups": "Water 2",
        "_id": "00211",
        "_rev": "1-A"
    },
    "monster_moves": [
        {
            "type_name": "normal",
            "identifier": "self-destruct",
            "power": 200,
            "pp": 5,
            "accuracy": 100,
            "description": "User faint, even if the attack fail or miss.  Inflicts regular damage.",
            "name": "Selfdestruct",
            "_id": "00120",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "scald",
            "power": 80,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 30% chance to burn the target.",
            "name": "Scald",
            "_id": "00503",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "round",
            "power": 60,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
            "name": "Round",
            "_id": "00496",
            "_rev": "1-A"
        },
        {
            "type_name": "poison",
            "identifier": "acid-spray",
            "power": 40,
            "pp": 20,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Lowers the target's Special Defense by two stages.",
            "name": "Acid-spray",
            "_id": "00491",
            "_rev": "1-A"
        },
        {
            "type_name": "poison",
            "identifier": "sludge-wave",
            "power": 95,
            "pp": 10,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 10% chance to poison the target.",
            "name": "Sludge-wave",
            "_id": "00482",
            "_rev": "1-A"
        },
        {
            "type_name": "poison",
            "identifier": "venoshock",
            "power": 65,
            "pp": 10,
            "accuracy": 100,
            "description": "Inflicts regular damage.  If the target is poisoned, this move has double power.",
            "name": "Venoshock",
            "_id": "00474",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "aqua-jet",
            "power": 40,
            "pp": 20,
            "accuracy": 100,
            "description": "Inflicts regular damage.",
            "name": "Aqua-jet",
            "_id": "00453",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "pain-split",
            "power": "",
            "pp": 20,
            "accuracy": "",
            "description": "Changes the user's and target's remaining HP to the average of their current remaining HP.  Ignores accuracy and evasion modifiers.  This effect does not count as inflicting damage for other moves and effects that respond to damage taken.\n\nThis effect fail against a substitute.",
            "name": "Pain-split",
            "_id": "00220",
            "_rev": "1-A"
        },
        {
            "type_name": "flying",
            "identifier": "bounce",
            "power": 85,
            "pp": 5,
            "accuracy": 85,
            "description": "Inflicts regular damage.  User bounces high into the air for one turn, becoming immune to attack, and hits on the second turn.  Has a 30% chance to paralyze the target.\n\nDuring the immune turn, gust, hurricane, sky-uppercut, smack-down, thunder, and twister still hit the user normally.  gust and twister also have double power against the user.\n\nThe damage from hail and sandstorm still applies during the immune turn.\n\nThe user may be hit during its immune turn if under the effect of lock-on, mind-reader, or no-guard.\n\nThis move cannot be used while gravity is in effect.\n\nThis move cannot be selected by sleep-talk.",
            "name": "Bounce",
            "_id": "00340",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "captivate",
            "power": "",
            "pp": 20,
            "accuracy": 100,
            "description": "Lowers the target's Special Attack by two stages.  If the user and target are the same gender, or either is genderless, this move will fail.",
            "name": "Captivate",
            "_id": "00445",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "aqua-tail",
            "power": 90,
            "pp": 10,
            "accuracy": 90,
            "description": "Inflicts regular damage.",
            "name": "Aqua-tail",
            "_id": "00401",
            "_rev": "1-A"
        },
        {
            "type_name": "poison",
            "identifier": "poison-jab",
            "power": 80,
            "pp": 20,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 30% chance to poison the target.",
            "name": "Poison-jab",
            "_id": "00398",
            "_rev": "1-A"
        },
        {
            "type_name": "poison",
            "identifier": "toxic-spikes",
            "power": "",
            "pp": 20,
            "accuracy": "",
            "description": "Scatters poisoned spikes around the opposing field, which poison opposing Pokémon that enter the field.  A second layer of these spikes may be laid down, in which case Pokémon will be badly poison instead.  Pokémon immune to either ground moves or being poison are immune to this effect.  Pokémon otherwise immune to ground moves are affected during gravity.\n\nIf a poison Pokémon not immune to ground moves enters a field covered with poisoned spikes, the spikes are removed.\n\nrapid-spin will remove this effect from its user's side of the field.  defog will remove this effect from its target's side of the field.\n\nThis move does not trigger synchronize, unless the Pokémon with synchronize was forced to enter the field by another effect such as roar.\n\nPokémon entering the field due to baton-pass are not affected by this effect.",
            "name": "Toxic-spikes",
            "_id": "00390",
            "_rev": "1-A"
        },
        {
            "type_name": "dark",
            "identifier": "payback",
            "power": 50,
            "pp": 10,
            "accuracy": 100,
            "description": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
            "name": "Payback",
            "_id": "00371",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "natural-gift",
            "power": "",
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Power and type are determined by the user's held berry.  The berry is consumed.  If the user is not holding a berry, this move will fail.",
            "name": "Natural-gift",
            "_id": "00363",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "brine",
            "power": 65,
            "pp": 10,
            "accuracy": 100,
            "description": "Inflicts regular damage.  If the target has less than half its max HP remaining, this move has double power.",
            "name": "Brine",
            "_id": "00362",
            "_rev": "1-A"
        },
        {
            "type_name": "steel",
            "identifier": "gyro-ball",
            "power": "",
            "pp": 5,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Power increases with the target's current Speed compared to the user, given by `1 + 25 * target Speed / user Speed`, capped at 150.",
            "name": "Gyro-ball",
            "_id": "00360",
            "_rev": "1-A"
        },
        {
            "type_name": "bug",
            "identifier": "signal-beam",
            "power": 75,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
            "name": "Signal-beam",
            "_id": "00324",
            "_rev": "1-A"
        },
        {
            "type_name": "dark",
            "identifier": "taunt",
            "power": "",
            "pp": 20,
            "accuracy": 100,
            "description": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me-first, metronome, mirror-move, and sleep-talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal-burst, and mirror-coat are allowed.",
            "name": "Taunt",
            "_id": "00269",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "spit-up",
            "power": "",
            "pp": 10,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Power is equal to 100 times the amount of energy stored by stockpile.  Ignores the random factor in the damage formula.  Stored energy is consumed, and the user's Defense and Special Defense are reset to what they would be if stockpile had not been used.  If the user has no energy stored, this move will fail.\n\nThis move cannot be copied by mirror-move.",
            "name": "Spit-up",
            "_id": "00255",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "stockpile",
            "power": "",
            "pp": 20,
            "accuracy": "",
            "description": "Raises the user's Defense and Special Defense by one stage each.  Stores energy for use with spit-up and swallow.  Up to three levels of energy can be stored, and all are lost if the user leaves the field.  Energy is still stored even if the stat boosts cannot be applied.\n\nIf the user uses baton-pass, the stat boosts are passed as normal, but the stored energy is not.",
            "name": "Stockpile",
            "_id": "00254",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "explosion",
            "power": 250,
            "pp": 5,
            "accuracy": 100,
            "description": "User faint, even if the attack fail or miss.  Inflicts regular damage.",
            "name": "Explosion",
            "_id": "00153",
            "_rev": "1-A"
        },
        {
            "type_name": "fighting",
            "identifier": "revenge",
            "power": 60,
            "pp": 10,
            "accuracy": 100,
            "description": "Inflicts regular damage.  If the target damaged the user this turn and was the last to do so, this move has double power.\n\npain-split does not count as damaging the user.",
            "name": "Revenge",
            "_id": "00279",
            "_rev": "1-A"
        },
        {
            "type_name": "ghost",
            "identifier": "destiny-bond",
            "power": "",
            "pp": 5,
            "accuracy": "",
            "description": "If the user faints before its next move, the Pokémon that faint it will automatically faint.  End-of-turn damage is ignored.\n\nThis move cannot be selected by assist or metronome.",
            "name": "Destiny-bond",
            "_id": "00194",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "substitute",
            "power": "",
            "pp": 10,
            "accuracy": "",
            "description": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effect-effects, confusion, and flinch.  The effects of smelling-salts and wake-up-slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect-effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap-berry.  magic-coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream-eater, embargo, flatter, gastro-acid, grudge, heal-block, leech-seed, lock-on, mean-look, mimic, mind-reader, nightmare, pain-split, psycho-shift, spider-web, sketch, swagger, switcheroo, trick, worry-seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt-absorb absorbing thunder-wave), such moves will not be blocked.\n\nlife-orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic-spikes.\n\nThe doll is passed on by baton-pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
            "name": "Substitute",
            "_id": "00164",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "mimic",
            "power": "",
            "pp": 10,
            "accuracy": "",
            "description": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror-move, nor selected by assist or metronome, nor forced by encore.",
            "name": "Mimic",
            "_id": "00102",
            "_rev": "1-A"
        },
        {
            "type_name": "electric",
            "identifier": "thunder-wave",
            "power": "",
            "pp": 20,
            "accuracy": 100,
            "description": "Paralyzes the target.",
            "name": "Thunder-wave",
            "_id": "00086",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "double-edge",
            "power": 120,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.",
            "name": "Double-edge",
            "_id": "00038",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "swords-dance",
            "power": "",
            "pp": 20,
            "accuracy": "",
            "description": "Raises the user's Attack by two stages.",
            "name": "Swords-dance",
            "_id": "00014",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "water-pulse",
            "power": 60,
            "pp": 20,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 20% chance to confuse the target.",
            "name": "Water-pulse",
            "_id": "00352",
            "_rev": "1-A"
        },
        {
            "type_name": "electric",
            "identifier": "shock-wave",
            "power": 60,
            "pp": 20,
            "accuracy": "",
            "description": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
            "name": "Shock-wave",
            "_id": "00351",
            "_rev": "1-A"
        },
        {
            "type_name": "ghost",
            "identifier": "astonish",
            "power": 30,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
            "name": "Astonish",
            "_id": "00310",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "dive",
            "power": 80,
            "pp": 10,
            "accuracy": 100,
            "description": "Inflicts regular damage.  User dives underwater for one turn, becoming immune to attack, and hits on the second turn.\n\nDuring the immune turn, surf, and whirlpool still hit the user normally, and their power is doubled if appropriate.\n\nThe user may be hit during its immune turn if under the effect of lock-on, mind-reader, or no-guard.\n\nThis move cannot be selected by sleep-talk.",
            "name": "Dive",
            "_id": "00291",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "secret-power",
            "power": 70,
            "pp": 20,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 30% chance to inflict an effect chosen according to the terrain.\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nBuilding       | Paralyze target\nCave           | Makes target flinch\nDeep water     | Lowers target's Attack by one stage\nDesert         | Lowers target's accuracy by one stage\nGrass          | Puts target to sleep\nMountain       | Makes target flinch\nRoad           | Lowers target's accuracy by one stage\nShallow water  | Lowers target's Attack by one stage\nSnow           | Freezes target\nTall grass     | Puts target to sleep\n\nIn Pokémon Battle Revolution:\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nCourtyard      | Paralyze target\nCrystal        | Makes target flinch\nGateway        | Lowers target's Attack by one stage\nMagma          | Makes target flinch\nMain Street    | Paralyze target\nNeon           | Paralyze target\nStargazer      | Makes target flinch\nSunny Park     | Puts target to sleep\nSunset         | Lowers target's accuracy by one stage\nWaterfall      | Puts target to sleep\n",
            "name": "Secret-power",
            "_id": "00290",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "facade",
            "power": 70,
            "pp": 20,
            "accuracy": 100,
            "description": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
            "name": "Facade",
            "_id": "00263",
            "_rev": "1-A"
        },
        {
            "type_name": "ice",
            "identifier": "hail",
            "power": "",
            "pp": 10,
            "accuracy": "",
            "description": "Changes the weather to hail for five turns, during which non-ice Pokémon are damaged for 1/16 their max HP at the end of every turn.\n\nIf the user is holding icy-rock, this effect lasts for eight turns.\n\nblizzard has 100% accuracy.  If the target has used detect or protect, blizzard has a (100 - accuracy)% chance to break through the protection.\n\nmoonlight, morning-sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with snow-cloak are exempt from this effect's damage.",
            "name": "Hail",
            "_id": "00258",
            "_rev": "1-A"
        },
        {
            "type_name": "ghost",
            "identifier": "shadow-ball",
            "power": 80,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
            "name": "Shadow-ball",
            "_id": "00247",
            "_rev": "1-A"
        },
        {
            "type_name": "ground",
            "identifier": "spikes",
            "power": "",
            "pp": 20,
            "accuracy": "",
            "description": "Scatters spikes around the opposing field, which damage opposing Pokémon that enter the field for 1/8 of their max HP.  Pokémon immune to ground moves are immune to this damage, except during gravity.  Up to three layers of spikes may be laid down, adding 1/16 to the damage done: two layers of spikes damage for 3/16 max HP, and three layers damage for 1/4 max HP.\n\nwonder-guard does not block damage from this effect.\n\nrapid-spin removes this effect from its user's side of the field.  defog removes this effect from its target's side of the field.",
            "name": "Spikes",
            "_id": "00191",
            "_rev": "1-A"
        },
        {
            "type_name": "ice",
            "identifier": "ice-beam",
            "power": 90,
            "pp": 10,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 10% chance to freeze the target.",
            "name": "Ice-beam",
            "_id": "00058",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "whirlpool",
            "power": 35,
            "pp": 15,
            "accuracy": 85,
            "description": "Inflicts regular damage.  For the next 2–5 turns, the target cannot leave the field and is damaged for 1/16 its max HP at the end of each turn.  The user continues to use other moves during this time.  If the user leaves the field, this effect ends.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.\n\nIf the target is in the first turn of dive, this move will hit with double power.",
            "name": "Whirlpool",
            "_id": "00250",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "rain-dance",
            "power": "",
            "pp": 5,
            "accuracy": "",
            "description": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp-rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar-beam has half power.\n\nmoonlight, morning-sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift-swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry-skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects-effects, and Pokémon with rain-dish heal 1/16 max HP at the end of each turn.",
            "name": "Rain-dance",
            "_id": "00240",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "hidden-power",
            "power": 60,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Power and type are determined by the user's IV.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IV.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
            "name": "Hidden-power",
            "_id": "00237",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "frustration",
            "power": "",
            "pp": 20,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
            "name": "Frustration",
            "_id": "00218",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "return",
            "power": "",
            "pp": 20,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
            "name": "Return",
            "_id": "00216",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "sleep-talk",
            "power": "",
            "pp": 10,
            "accuracy": "",
            "description": "Only usable if the user is sleep.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus-punch, me-first, metronome, mirror-move, shadow-force, skull-bash, sky-attack, sky-drop, sleep-talk, solar-beam, razor-wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast-burn, frenzy-plant, giga-impact, hydro-cannon, hyper-beam, roar-of-time, or rock-wrecker—and the user is still sleep next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror-move, nor selected by assist, metronome, or sleep-talk.",
            "name": "Sleep-talk",
            "_id": "00214",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "attract",
            "power": "",
            "pp": 15,
            "accuracy": 100,
            "description": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
            "name": "Attract",
            "_id": "00213",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "swagger",
            "power": "",
            "pp": 15,
            "accuracy": 90,
            "description": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
            "name": "Swagger",
            "_id": "00207",
            "_rev": "1-A"
        },
        {
            "type_name": "rock",
            "identifier": "rollout",
            "power": 30,
            "pp": 20,
            "accuracy": 90,
            "description": "Inflicts regular damage.  User is forced to use this move for five turns.  Power doubles every time this move is used in succession to a maximum of 16x, and resets to normal after the lock-in ends.  If this move misses or becomes unusable, the lock-in ends.\n\nIf the user has used defense-curl since entering the field, this move has double power.",
            "name": "Rollout",
            "_id": "00205",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "endure",
            "power": "",
            "pp": 10,
            "accuracy": "",
            "description": "The user's HP cannot be lowered below 1 by any means for the remainder of this turn.\n\nIf the user successfully used detect, endure, protect, quick-guard, or wide-guard on the last turn, this move has a 50% chance to fail.\n\nThis move cannot be selected by assist or metronome.",
            "name": "Endure",
            "_id": "00203",
            "_rev": "1-A"
        },
        {
            "type_name": "ice",
            "identifier": "icy-wind",
            "power": 55,
            "pp": 15,
            "accuracy": 95,
            "description": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
            "name": "Icy-wind",
            "_id": "00196",
            "_rev": "1-A"
        },
        {
            "type_name": "poison",
            "identifier": "sludge-bomb",
            "power": 90,
            "pp": 10,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 30% chance to poison the target.",
            "name": "Sludge-bomb",
            "_id": "00188",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "protect",
            "power": "",
            "pp": 10,
            "accuracy": "",
            "description": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick-guard, or wide-guard on the last turn, this move has a 50% chance to fail.\n\nlock-on, mind-reader, and no-guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn-drill, and sheer-cold); those are always blocked by this move.\n\nthunder during rain-dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom-desire and future-sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish-song\n* shadow-force\n* Moves that merely copy the user, such as transform or psych-up\n\nThis move cannot be selected by assist or metronome.",
            "name": "Protect",
            "_id": "00182",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "flail",
            "power": "",
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Power varies inversely with the user's proportional remaining HP.\n\n64 * current HP / max HP | Power\n-----------------------: | ----:\n 0– 1                    |  200\n 2– 5                    |  150\n 6–12                    |  100\n13–21                    |   80\n22–42                    |   40\n43–64                    |   20\n",
            "name": "Flail",
            "_id": "00175",
            "_rev": "1-A"
        },
        {
            "type_name": "ghost",
            "identifier": "curse",
            "power": "",
            "pp": 10,
            "accuracy": "",
            "description": "If the user is a ghost: user pays half its max HP to place a curse on the target, damaging it for 1/4 its max HP every turn.\nOtherwise: Lowers the user's Speed by one stage, and raises its Attack and Defense by one stage each.\n\nThe curse effect is passed on by baton-pass.\n\nThis move cannot be copied by mirror-move.",
            "name": "Curse",
            "_id": "00174",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "snore",
            "power": 50,
            "pp": 15,
            "accuracy": 100,
            "description": "Only usable if the user is sleep.  Inflicts regular damage.  Has a 30% chance to make the target flinch.",
            "name": "Snore",
            "_id": "00173",
            "_rev": "1-A"
        },
        {
            "type_name": "psychic",
            "identifier": "rest",
            "power": "",
            "pp": 10,
            "accuracy": "",
            "description": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect-effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early-bird.\n\nThis move fail if the Pokémon cannot fall asleep due to uproar, insomnia, or vital-spirit.  It also fails if the Pokémon is at full health or is already asleep.",
            "name": "Rest",
            "_id": "00156",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "swift",
            "power": 60,
            "pp": 20,
            "accuracy": "",
            "description": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
            "name": "Swift",
            "_id": "00129",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "waterfall",
            "power": 80,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 20% chance to make the target flinch.",
            "name": "Waterfall",
            "_id": "00127",
            "_rev": "1-A"
        },
        {
            "type_name": "ice",
            "identifier": "haze",
            "power": "",
            "pp": 30,
            "accuracy": "",
            "description": "Removes stat, accuracy, and evasion modifiers from every Pokémon on the field.\n\nThis does not count as a stat reduction for the purposes of clear-body or white-smoke.",
            "name": "Haze",
            "_id": "00114",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "defense-curl",
            "power": "",
            "pp": 40,
            "accuracy": "",
            "description": "Raises user's Defense by one stage.\n\nAfter this move is used, the power of ice-ball and rollout are doubled until the user leaves the field.",
            "name": "Defense-curl",
            "_id": "00111",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "minimize",
            "power": "",
            "pp": 10,
            "accuracy": "",
            "description": "Raises the user's evasion by two stages.\n\nstomp and steamroller have double power against Pokémon that have used this move since entering the field.",
            "name": "Minimize",
            "_id": "00107",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "harden",
            "power": "",
            "pp": 30,
            "accuracy": "",
            "description": "Raises the user's Defense by one stage.",
            "name": "Harden",
            "_id": "00106",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "double-team",
            "power": "",
            "pp": 15,
            "accuracy": "",
            "description": "Raises the user's evasion by one stage.",
            "name": "Double-team",
            "_id": "00104",
            "_rev": "1-A"
        },
        {
            "type_name": "poison",
            "identifier": "toxic",
            "power": "",
            "pp": 10,
            "accuracy": 90,
            "description": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
            "name": "Toxic",
            "_id": "00092",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "bubble-beam",
            "power": 65,
            "pp": 20,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 10% chance to lower the target's Speed by one stage.",
            "name": "Bubblebeam",
            "_id": "00061",
            "_rev": "1-A"
        },
        {
            "type_name": "ice",
            "identifier": "blizzard",
            "power": 110,
            "pp": 5,
            "accuracy": 70,
            "description": "Inflicts regular damage.  Has a 10% chance to freeze the target.\n\nDuring hail, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.",
            "name": "Blizzard",
            "_id": "00059",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "surf",
            "power": 90,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.\n\nIf the target is in the first turn of dive, this move will hit with double power.",
            "name": "Surf",
            "_id": "00057",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "hydro-pump",
            "power": 110,
            "pp": 5,
            "accuracy": 80,
            "description": "Inflicts regular damage.",
            "name": "Hydro-pump",
            "_id": "00056",
            "_rev": "1-A"
        },
        {
            "type_name": "water",
            "identifier": "water-gun",
            "power": 40,
            "pp": 25,
            "accuracy": 100,
            "description": "Inflicts regular damage.",
            "name": "Water-gun",
            "_id": "00055",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "supersonic",
            "power": "",
            "pp": 20,
            "accuracy": 55,
            "description": "Confuse the target.",
            "name": "Supersonic",
            "_id": "00048",
            "_rev": "1-A"
        },
        {
            "type_name": "bug",
            "identifier": "pin-missile",
            "power": 25,
            "pp": 20,
            "accuracy": 95,
            "description": "Inflicts regular damage.  Hits 2–5 times in one turn.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.",
            "name": "Pin-missile",
            "_id": "00042",
            "_rev": "1-A"
        },
        {
            "type_name": "poison",
            "identifier": "poison-sting",
            "power": 15,
            "pp": 35,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 30% chance to poison the target.",
            "name": "Poison-sting",
            "_id": "00040",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "take-down",
            "power": 90,
            "pp": 20,
            "accuracy": 85,
            "description": "Inflicts regular damage.  User takes 1/4 the damage it inflicts in recoil.",
            "name": "Take-down",
            "_id": "00036",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "tackle",
            "power": 50,
            "pp": 35,
            "accuracy": 100,
            "description": "Inflicts regular damage.",
            "name": "Tackle",
            "_id": "00033",
            "_rev": "1-A"
        },
        {
            "type_name": "normal",
            "identifier": "headbutt",
            "power": 70,
            "pp": 15,
            "accuracy": 100,
            "description": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
            "name": "Headbutt",
            "_id": "00029",
            "_rev": "1-A"
        }
    ]
}